[
  {
    "tittle": "DevTools Toolkit - Ferramentas de Desenvolvimento",
    "description": "Site com um conjunto de ferramentas de desenvolvimento e organização, criadas para agilizar tarefas diárias e concentrar tudo em um único local. Desenvolvido em HTML básico, CSS e JavaScript. -- Ferramentas como: 1. To do list.; 2. Formatador e validador de JSON.; 3. Visualizador de BBox marks.; 4. Gerador de Timestamp (ObjectID do MongoDB).; 5. Visualizador de imagens Base64.; 6. Visualizador de HTML.; 7. Lista personalizada de sites úteis.",
    "github link": "https://github.com/AlvaroPereir4/DevBelt",
    "project link": "https://dev-belt.vercel.app/",
    "doc_link": "https://www.notion.so/devbelt-2910166bb9f6804db29af9e69a00c646?source=copy_link"
},
  {
    "tittle": "Base64 Viewer - Visualizador de Imagens Base64",
    "description": "Uma aplicação executável para visualização de imagens Base64, oferecendo diversas flexibilidades tanto na visualização quanto na usabilidade. Focada em permitir análise contínua enquanto outras tarefas são executadas. Conta com funcionalidades pensadas para auxiliar processos de inspeção, como o modo PiP (Picture in Picture), que possibilita manter as imagens processadas sobrepostas a qualquer outra aplicação do sistema.",
    "github link": "https://github.com/AlvaroPereir4/B64V",
    "project link": null,
    "doc_link": "https://www.notion.so/base64viewer-2360166bb9f6804db1dace52e5f56c54?source=copy_link"
  },
  {
    "tittle": "AutodocHub - Gerador de Orçamentos e Recibos",
    "description": "Aplicação web focada em automatizar o processo de geração de orçamentos e recibos, oferecendo flexibilidade para ser compatível com qualquer tipo de prestação de serviço. Possui formulários dinâmicos, presets personalizados, geração de PDF e diversas funcionalidades voltadas à usabilidade. Banco de dados armazenado no MongoDB, com collections automatizadas e salvamento de PDFs através de arquivos gerados automaticamente. Inclui presets de formulários personalizados para reutilização, como informações pessoais, dados de pagamento, detalhes padrão de acordos e informações repetitivas. Back-end desenvolvido em Python e front-end em HTML, CSS e JS. Possui tradução completa em PT-BR e inglês, além de personalizações visuais no front-end, como temas, fontes e outras opções de formatação.",
    "github link": "https://github.com/AlvaroPereir4/AutoDocHub",
    "project link": null,
    "doc_link": "https://www.notion.so/AutodocHub-23a0166bb9f6803195d5f5eb44f851b7?source=copy_link"
  }
]